Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN Romance Punch.tmx
Source language: id
Languages: en

source: SERIUS, KAYAK ADA SILUET ORANG DI SANA, HANTU KALI!
en: (incorrect segments, translation moved to the missing text sheet)

source: SUDAH SAYA
en: I’ve

source: TERAKHIR
en: Putra pranked them

source: USAHA KERASKU USETELAH BERTAHUN-TAHUN MULAI MENEMUKAN TITIK TERANG!
en: my years of hard work have started to bear some fruits!

source: SIH?
en: know?

source: ORANG BERANTEM?
en: who’s fighting?

source: YANG BODOH!
en: was nonsense!

source: INI ACARA YANG MENYENANGKAN, KITA AKAN MEMPERJELAS SEMUA GOSIP MENGENAI KAMU DAN IBUMU.
en: this will be fun. we’ll clear up the gossip about you and your mother.

source: BERLEBIHAN.
en: the extra mile.

source: MEMBANTU KAMI
en: getting us

source: KITA GAK MAU KETAHUAN!!
en: we don’t want anyone to find out!

source: SUKA-SUKA GUA MAU NGAPAIN!
en: Not your business, isn’t it?

source: HARI INI…
en: earlier...

source: DI SEKOLAH!
en: at school!

source: MENYALAHKAN KITA
en: blamed us

source: INI SALAHKU,
en: I had

source: JANGAN BERCANDA,
en: You must be joking...

source: TERUS KENAPA GUA
en: why do I

source: AKU CERITA,
en: tell you later,

source: EH, NARA?!
en: nara?!

source: LAKUKAN?
en: action?

source: BIARKAN AKU
en: let me

source: GAK USAH NGOMONG!
en: without my permission!

source: KAMU NGOMONG
en: what did you

source: MASA-MASA
en: me of those

source: TERKEPUNG!
en: surrounded!

source: NGGAK
en: nope,

source: SMA INI
en: this school

source: LAGIAN PIZZA INDONESIA TUH APA?!
en: and what do you mean by indonesian pizza?

source: NIH SEKARANG SI NARA MALAH IKUT-IKUTAN NYURUH JANGAN KE PROM JUGA.
en: even nara asks me not to go to prom.

source: TENGKORAK BESI UDAH JAUH LEBIH BAIK, DAN LU GAK USAH MIKIRIN MEREKA.
en: the iron skull has been doing pretty well recently, so you don’t need to think about them.

source: SIAPA GADIS INI?
en: who’s this girl?

source: DI PERANCIS?
en: today...

source: APAPUN
en: No matter

source: AH, DIA CEWEK
en: Oh! I saw

source: HIII, SEREM BANGET!!
en: Oh my god, I’m scared to death!

source: WAKTU
en: I sent you

source: PUKULANNYA
en: his punch was

source: MALAH KETEMU
en: Ugh... just

source: SEKARANG LU
en: for now,

source: TASLIM, KALAU
en: taslim,

source: AKU PERCAYA SAAT MEREKA BILANG
en: I believed them when they said

source: MACHO!
en: now!

source: KABUR?
en: your hands dirty, do you?

source: HAI, ANAK
en: hello, my dear

source: YA, JUSTRU SEKARANG KITA HARUS JAGA-JAGA!
en: yes, but that means we have to be more alert!

source: CIH, DASAR,
en: tsk...

source: BORING
en: I’ve

source: EITS,
en: Oops,

source: PLS
en: Oh, come on!

source: NGEBOSENIN JUGA, SIH…
en: (incorrect segments, translation moved to the missing text sheet)

source: LAGI NGURUS
en: will take care

source: MALAH DI SINI?
en: are you here?

source: KAMU LIHAT SEKOLAH KITA?
en: have you seen our school lately?

source: MASALAH ANAK HARAM!
en: about me having a “bastard” son!

source: KENAPA SUKA?
en: “why” you asked?

source: CUMA ANDA
en: only you

source: KAMU INGIN
en: really wanna

source: MEMBANTU
en: help

source: KAMU GAK ADA
en: because

source: GAK RECOMMENDED!
en: at all!

source: OOH!
en: oh!

source: RAME-RAME?
en: commotion?

source: KOMANDO
en: your

source: WAH, MAKASIH RAT!
en: oh, thank you, ratu!

source: MUNGKIN PERLU GUA
en: Do I

source: MEREKA DI SANA.
en: there.

source: WAKTU ITU
en: I remember what

source: CANGKANG
en: reversed

source: GAK ADA ALASAN KHUSUS, LU KAYAK COCOK JAGA DI GARIS DEPAN.
en: there’s no specific reason for this, we just think you suit the role as a front guard.

source: SEJAK
en: you’re

source: GUA DENGAR RUMOR TENTANG MANTAN PEMAIN BASEBALL YANG SELALU BERANTEM PAKAI BASEBALL BAT…
en: I heard a rumor about an ex-baseball player who always fights with a baseball bat...

source: TAPI MEREKA
en: but they

source: TAPI UNTUK SEKARANG AKU PUNYA INFO YANG LEBIH MENARIK!
en: but now, I have something more interesting!

source: COWOK
en: the naughty

source: DAN KENAPA KAMU SENDIRI?!
en: what are you doing here by yourself, huh?!

source: MAAF-
en: I’m really

source: ISTIRAHAT DULU, GIH!
en: (incorrect segments, translation moved to the missing text sheet)

source: GAK ADA YANG PEDULI
en: no one cares

source: JADI HENTIKAN
en: so please,

source: DHASS
en: wham

source: SI PUTRA!
en: for you!

source: KA' DAMAR KENAPA SERIUS BANGET, SIH?
en: why are you so serious, damar?

source: HARUSNYE ADEGANNYE
en: It wasn’t supposed to

source: A-AKU BARUSAN MELUK TEX!
en: I-I just hugged tex!

source: Amel, bisa ke gudang gak?
en: amel, could you come to the warehouse?

source: SAMA NIA, KAN!
en: with her, right?!

source: "ANU"-MU…
en: the balls...

source: SAAT PROM DIMULAI, APAPUN BISA TERJADI!
en: when it begins, anything can happen!

source: PLUSHIE
en: I guess

source: GUA LAGI ADA HAL LAIN…
en: I gotta take care of something first...

source: SKANDAL!
en: a scandalous video!

source: DUH KAMU GAKPAPA BAWAIN INI BUAT PROM?
en: are you okay bringing this for the prom?

source: APA ADA
en: is there

source: BELUM?
en: a nice guy now?

source: YANG HARUSNYA
en: the one

source: WALAU KAMU
en: you’re very

source: TENAGA
en: he still

source: NIA TITIP AMEL, YA
en: (incorrect segments, translation moved to the missing text sheet)

source: CEWEK KOK LEMAH
en: I can’t believe you’d

source: YANG NGURUS.
en: into our own hands.

source: TURNAMEN NASIONAL
en: flick royale

source: SUKA SAMA
en: I’d have a crush

source: MEMPAN!!
en: work!

source: INI!
en: other!

source: TELL ME MORE, KAMU LIHATNYA DI MANA?
en: (incorrect segments, translation moved to the missing text sheet)

source: DILEMPAR TELUR
en: I threw eggs at you,

source: ANAK YANG BAIK…
en: behave yourselves...

source: SI DIAN MARAH?
en: dian is furious?

source: DEKAT SINI, DAN DAMAR BILANG
en: he said that

source: CERITA-CERITA.
en: tell me details...

source: HAHA,
en: Hahaha...

source: GAK BAKAL
en: will only end

source: JUGA BOSAN.
en: just bored.

source: BOOOO!!
en: booo!

source: ORANG JATUH CINTA,
en: when they’re in love.

source: BOS GUA!
en: boss!

source: MASIH KEBAKAR!
en: is still on fire!

source: KITA LIHAT
en: let’s see

source: YA ENGGAKLAH!
en: What? of course not!

source: ARGH, GUA JUGA KENA!!
en: argh, I got hit too!

source: BAAM
en: Boom

source: SEMUA DILAKUKAN
en: they’d

source: BRENGSEK YANG
en: who dare

source: PILIHAN AMEL!!!
en: Make your decision, Amel!

source: LOH?
en: huh?

source: NGAPAIN LU NGELIAT GUA?!
en: why are you looking at me?!

source: DEH.
en: act?

source: INI BONI, LOH!
en: this is boni we’re talking about!

source: DENGAN BEGINI
en: this way,

source: GAK MUNGKIN!
en: What?!

source: SEGININYA?
en: really necessary?

source: KYAAA!!
en: kyaa!

source: RUMOR ITU BENAR?
en: is it true?

source: MENGHINA FISIK
en: make fun of him

source: DIA NGUNDANG KITA KE ISTANA ITU UDAH NUNJUKIN NIAT BAIKNYA…
en: inviting us to the palace is his way to show good intentions...

source: SEKOLAH INI!
en: this school!

source: ATAU BETE KARENA NARA GAK DATANG?
en: or just in a bad mood because nara didn’t come?

source: PADAKU
en: me

source: GAK ADA WAKTU, NIH!
en: we don’t have much time!

source: MELAWAN PILAR BESI
en: fought

source: KESALAHAN,
en: Just so you know,

source: PERCAYA
en: This is what you

source: YA ENAK SIH… CUMA NGAKU AJA KA' DAMAR KAGAK BISA TRAKTIR PIZZA!
en: it’s delicious... you should’ve just told me that you couldn’t afford to buy me a pizza.

source: MEREKA MENJAGA TIAP PARAMETER UNTUK MELINDUNGI ANAK-ANAK INI!
en: they’re guarding the perimeter to keep these people safe.

source: TEPAT WAKTU
en: in time,

source: SI
en: Hurry up,

source: AKU HANYA
en: I just didn’t

source: INI TIDAK SESUAI
en: In anime, the main character

source: GAK KEBALIK,
en: You get behind

source: JUGA DIHUNI SETAN,
en: an eccentric old geezer.

source: ADA URUSAN
en: to take care

source: LULUS LAH!
en: I did!

source: LU NYARI SIAPA?
en: who are you looking for?

source: KAKIMU CIDERA, KAN?
en: you’re foot is injured, right?

source: KABAR DARI MEREKA.
en: from them.

source: PEMBLOKIRAN?!
en: a blockade or something?!

source: GAK PEDULI LAGI
en: don’t

source: LU AMEL?
en: so, you’re amel?!

source: PULANG, YUK…
en: get out of here now...

source: UDAH CANTIK
en: It’d be so unfair

source: COWOK-COWOK!
en: boys?!

source: TAHU KITA PUNYA
en: there were

source: TAPI MEMANG DASAR
en: I guess bad stains are

source: IYA!!
en: yes!

source: DIKUNCI!!!
en: the door was locked!

source: NGASIH
en: you gave me

source: DALAM SEKEJAB
en: to cast him

source: ADA SEKOLAH YANG
en: you be guarding

source: DIA CERITA
en: she

source: KEBENCIAN.
en: each other.

source: SEKARANG DIA
en: here,

source: GAK PERLU LU SURUH!
en: You don’t have to tell me twice!

source: SATU ORANG,
en: left.

source: AKU BELUM KELAR
en: I’m not done with you,

source: BISA KALIAN
en: can you guys

source: AHAHA GAPAPA NI!
en: (incorrect segments, translation moved to the missing text sheet)

source: MUNGKIN…
en: way...

source: MEREKA BISA MENYERANG KAPANPUN!
en: they could attack anytime soon!

source: HARUSNYA GUA GAK PERCAYA AMEL DARI AWAL!
en: I shouldn’t have trusted amel from the beginning!

source: YA SEENGGAKNYA
en: well, at least

source: SIAPAPUN!
en: right away!

source: ANEH BANGET BUAT SEORANG PUTRA!
en: Never thought I’d see the day.

source: NGAKU-NGAKU MAU
en: they said

source: CKITT
en: screech

source: KENAPA LU?
en: (incorrect segments, translation moved to the missing text sheet)

source: DIA JUGA
en: he won’t

source: LU GAK PAPA, KAN?
en: are you okay?

source: RENCANA MEREKA BERHASIL,
en: of their plan,

source: APA MAKSUD LU?!
en: what do you mean?!

source: TAPI BUAT JAGA-JAGA GUA SARANIN LU HUBUNGIN DIA.
en: just in case, i think you’d better ring him up.

source: KAMI TIDAK BISA MEMBIARKANMU PERGI, INI URUSAN KEPRESIDENAN!
en: we can’t let you leave.this is a part of the president’s agenda!

source: ROMANCE.PUNCH
en: ROMANCE PUNCH S2

source: SANGAT SERIUS
en: paintings were

source: BIARKAN MEREKA MENYELESAIKAN URUSAN MEREKA SENDIRI!
en: let them finish their business!

source: SIAPA YANG LEMPAR BARU?!
en: who threw that?!

source: DIAN, GUA PASTI JAGA ADEK LU!
en: dian, I’ll make sure your sister is safe!

source: ITU SUDAH CUKUP,
en: I’m happy.

source: NGGAK, NGGAK,
en: Ugh...

source: KAMU BELUM SADAR?
en: Haven’t you realized?!

source: YANG BERJAUHAN
en: two different angles

source: TUNGGU SAMPAI PUTRA TAHU!!
en: wait until putra finds out about this!

source: JUSTRU ITU…
en: your face...

source: POHON.
en: part.

source: WUT
en: whoop

source: DIA BISA BIKIN NARA DAN PUTRA TERTAWA SEPERTI INI…
en: How is she able to make them smile like this?

source: AKU SUDAH TIDAK
en: I don’t need you

source: LU SEMUA BUDEK APA BEGO, SIH?
en: are you guys really this dense?

source: LU JADI
en: my

source: MUDAH.
en: be easy.

source: DIA BAIK-BAIK
en: she’s

source: LU GILA?!
en: are you out of your mind?!

source: GAK SECEPAT
en: as fast as

source: LAH?
en: huh?

source: DI COFFEE SHOP
en: run the coffee shop,

source: TERTANGKAP
en: did you get caught

source: KAMU KETIDURAN!
en: you overslept!

source: KALAU BAIK KAN
en: if she had both the looks and

source: LUKA DI WAJAH LU
en: your face.

source: DENGAN LU YANG "SELALU"
en: someone who

source: INI MIMPI?!
en: am i dreaming?!

source: MELIHAT SEKOLAH INI
en: make me

source: GUNAKAN ADIK DIAN YANG
en: who was supposed to be guarded by amel,

source: SILAHKAN PAK!
en: the time is yours, sir!

source: HABISI KANTIN UTARA!!
en: let’s finish those north canteen scums!

source: LU YANG
en: Huh?! you’re

source: NUNJUKIN PERSONALITI
en: personality,

source: AKU HABIS
en: I just

source: DIA MABUK?!
en: is she drunk?!

source: INI AJA DEH
en: maybe ratu will

source: "EH" APAAN?
en: what?

source: UMM…
en: Oh,

source: JANGAN DIULANG, YA!
en: don’t do it again, okay?!

source: PUTRA BAKAL BERJAGA DI GERBANG DEPAN!
en: putra will guard the front gate!

source: MEMALUKAN ITU!
en: embarrassing times!

source: EH, LO GAK TAHU?
en: you don’t know?

source: KANGEN PIZZA INDONESIA, NIH!
en: I’m dying for some Indonesian Pizza right now!

source: DI JEMBATAN
en: you said

source: ASAL OM TAHU
en: just so you know,

source: ENTAH APA TUJUAN PILAR BESI MENENTANG FROM.
en: nobody knows why the iron pillars are strongly against the prom.

source: THE STANDARD
en: this is the standard

source: GINI?
en: she’d pass out at a time like this!

source: EH, TAPI…
en: (incorrect segments, translation moved to the missing text sheet)

source: LEWAT…
en: passed...

source: HATILAH.
en: okay?

source: BAHAS ITU!
en: you doofus!

source: DIULANG.
en: start over.

source: JATUH CINTA…
en: in love...

source: DI MANA,
en: the heck

source: BODOHNYA AKU
en: I came

source: AKU GAK INGAT APA-APA…
en: I don’t remember anything...

source: EH, ENAK DEH, APAAM NIH?
en: this is good! what is this?

source: KITA PERLU MENYERANG
en: we need to attack

source: APA PERLU
en: is this

source: MASIH
en: still on

source: KATA-KATAMU
en: between two stray cats.

source: WOI, PENGECUT, MAJU SINI!
en: you coward, come here!

source: HEI, AKU CUMA
en: hey, I’m just

source: WKWKWKW
en: Hahahaha

source: HENTIKAN.
en: stop it.

source: GILA,
en: like you...

source: DINGIN BANGET!
en: you should be there, you know...

source: TUNGGU BENSINNYA DISEBAR SEMUA!
en: wait until we pour all the gasoline!

source: SIAPA PEDULI SOAL NARA!
en: who cares about nara anyway?!

source: JADI GIMANA RENCANYA?
en: what’s the plan?

source: HEI!
en: hey!

source: MENYERAHLAH!
en: just give up already!

source: ADIKNYA DIAN BIAR AKU YANG URUS!
en: I’ll take care of her!

source: YANG BOLEH
en: allowed

source: DENGAN VIDEO
en: with

source: BUATMU…
en: lesson...

source: API?!!
en: fire?!

source: MASALAH GUA SEDERHANA,
en: it’s simple.

source: KEPALA GUA KENA RANSEL LU!
en: I think i just hit my head on your backpack!

source: YA, TENTU SAJA
en: well, of course...

source: OH, LU MAU
en: Huh? don’t wanna get

source: GIMANA MENURUT LU
en: what do you think

source: BERTAHANLAH DI SINI!
en: stay here, okay?!

source: AKU AKAN JADI
en: I’ll

source: HUBUNGI POLISI
en: contacted the police

source: BERCANDA…
en: joking...

source: AKU SAMA DAMAR LAGI MAKAN
en: Damar and I were having a meal near here.

source: DI LUAR SEKOLAH!
en: outside the school!

source: GAK ADIL!
en: the heart!

source: KITA AKAN BERJAGA DALAM LINGKUP TERTENTU UNTUK MENG-COVER SETIAP PERIMETER!
en: we’ll divide the group to cover each perimeter!

source: TON, MAJU TON!
en: toni, get him!

source: TIDUR?
en: (incorrect segments, translation moved to the missing text sheet)

source: HOI, GAK
en: hey, no one

source: DENGERIN
en: my plan,

source: KE-KEMARIN PAS AKU ULTAH!
en: when we celebrated my birthday!

source: EKSPRESINYA
en: oh, crap, they’re

source: TAK ADA
en: I can’t find

source: KENAPA BAJUKU BASAH?
en: why are my clothes wet?

source: PERNAH LIHAT?
en: familiar...

source: MENDEKAT!
en: closer!

source: KITA HARUS NOLONGIN LU.
en: you needed our help.

source: SAMPAI DAMAR
en: until I can beat

source: PERCUMA!
en: it’s futile!

source: YANG SAMA!
en: on one spot!

source: MAEN KE KANDANG GAJAH EG, KENA TABOK BELAKAI!
en: When we got there, there was an elephant that looked like a cow!

source: MAU LEWAT
en: where do you think

source: EH, AKU
en: huh? I should be

source: PINTUNYA BAHKAN DIKUNCI!
en: the door’s locked!

source: SAMPAI MOLOR
en: I can’t believe

source: KAYAK ANAK NAKAL,
en: look like a bad boy,

source: KEBETULAN...
en: what a coincidence!

source: AYO KITE
en: let’s

source: UDAH KAYAK
en: don’t I

source: MEREPOTKAN,
en: to beat,

source: MENINGGALKAN POSNYA,
en: finally left his post

source: TIDAK BISA!
en: I can’t!

source: GUA INGUSAN
en: I’m a snotty

source: SERANGAN KAH?
en: are we under attack?

source: CELAH!!
en: an opening!

source: YAUDAH, GUA CEK SENDIRI DULU, SEMOGA SESUATUYANG MENARIK, HANTU JUGA BOLEH.
en: (incorrect segments, translation moved to the missing text sheet)

source: KITA JUGA BELUM TAHU APA RENCANA PILAR BESI.
en: we also don’t know what’s the iron pillars are planning yet.

source: YANG JELAS…
en: stuff...

source: GOSIPNYA,
en: I heard

source: A-AKU
en: I-I’m

source: LUCU BANGET PRANK APRIL MOP KALIAN!
en: what a silly april fool’s prank!

source: DENGAN PERSIAPAN,
en: fully prepared.

source: NARA DAN PUTRA
en: Maybe Nara and Putra

source: DIA!!
en: it’s him!

source: ADA APA SIH?!
en: what’s with that look?

source: RENCANAKU!
en: you doofus!

source: OH IYA…
en: oh, right...

source: TA-TADI KITA BEREMPAT, KOK!
en: there were four of us, i swear!

source: INI LEPASIN
en: just take these off

source: TUK TUK
en: tap tap

source: JAM 7…
en: it’s 7 P.M...

source: BUAT PILAR BESI
en: the iron pillars

source: URUSAN APA
en: It couldn’t

source: INTINYA SEMUA BERSEMANGAT UNTUK PROM, KECUALI PARA PILAR BESI MEREKA MENOLAK KERAS SEJAK TAHU FROM AKAN DIADAKAN PADA 1 APRIL.
en: everyone is excited to go to prom, except for the iron pillars. They’ve been strongly objecting this festivity ever since the first time they knew that it’d be held on the 1st of April.

source: MENARIK!
en: girl!

source: NGUUNG
en: whirr

source: BIAR GUA YANG
en: me

source: GAK USAH BACOT…
en: Shut your mouth...

source: DIA SEMAKIN
en: he became

source: GILIRAN KALIAN!
en: heads!

source: LU PUNYA DUA TUGAS, JAGA AMEL DAN AWASIN RATU!
en: you’ll have two tasks, guard amel and keep an eye on ratu!

source: MEL, KAYAKNYA KAMU KECAPEAN, DEH.
en: (incorrect segments, translation moved to the missing text sheet)

source: AKAN BERGERAK KE GERBANG.
en: are heading to the gate.

source: SAYA BISA PUNYA
en: known

source: KALIAN BELUM
en: I can’t believe

source: MENGEJUTKAN, TAPI TIDAK JUGA…
en: surprising, but not really...

source: PEMENANG
en: winner of the

source: ANAK BUAH GUA.
en: it from here.

source: HUFH, UNTUNG GAK KECELAKAAN…
en: huff... thank god I’m still alive.

source: AKU BENCI KAMU…
en: I hate you...

source: DI SARANG NAGA…
en: at a dragon’s lair.

source: WAKTU YANG
en: you to make

source: TERKUAT KEDUA
en: student of

source: GUA BISA MENAHAN DIA
en: I could’ve stopped

source: PARA MURID DIALIHKAN KE
en: the students were

source: KITA KETEMU
en: let’s meet up

source: AKU YAKIN PINTUNYA
en: I swear

source: TAPI, SIAPA BILANG
en: But, who says that

source: UNTUNGLAH
en: thank god

source: INGUS DOANG
en: it’s just snot,

source: TAPI UDAH SETAHUN
en: But it’s been a year and

source: HEAAH!!
en: ...go!!!

source: BILANG LU LUPA.
en: me you you’ve forgotten

source: HATI-HATI BANG!!
en: Be careful please!

source: TANGAN GUA DIGIGIT
en: I can’t believe

source: MALAM YANG GAWAT SEKALI
en: a super chaotic night

source: PADAKU…
en: told me...

source: TUTUP
en: seal

source: B*NGS*T!
en: you bastard!

source: COCOK BUAT LU…
en: you...

source: DI SINI, SIH.
en: mind...

source: HENTIKANLAH
en: stop this

source: GUA SUDAH
en: I’ve managed

source: IYA, KITA AKAN MAKAN SIANG DI ISTANA.
en: yes, we’ll have lunch at the presidential palace.

source: OH YA, WALAUPUN PROMNYA SEBELUM UN, AKU HARAP SEMUANYA TETAP BISA ENJOY!
en: Oh, even though this prom is held before the national exam, I hope everyone can still have a good time!

source: KHAWATIR
en: worry,

source: KAMU HARUS HORMATI IBUMU…
en: you need to respect your mother...

source: PADAKU...
en: me.

source: PEMBUKA JALANMU!
en: open the way for you!

source: SUUUH
en: swoosh

source: DAN TENTU SAJA AMEL!
en: I’ll keep amel safe too!

source: EH TAPI
en: huh, but

source: WOI,
en: tsk!

source: SEHARUSNYA DIJAGAIN
en: as

source: DARI AMATIR.
en: an amateur like you.

source: GUA KE PASAR DULU NYAPIN REQUEST LU, GUA YANG TERAKHIR?
en: Sorry, I went to the market to buy the things you requested first. am I the last to arrive?

source: PAS KAMU ULTAH?
en: your birthday?

source: MUKUL ORANG…
en: punched someone...

source: TEBAK,
en: Do you know

source: PADAHAL MAMA BARU MAU SURUH SIAP-SIAP.
en: I was just about to tell you to get ready.

source: AKU KEPIKIRAN DIA TERUS
en: I think about her a lot,

source: SUDAH MENGINGATKAN
en: for reminding

source: HAI!
en: Hey-ho!

source: UNTUK BAROTO
en: on baroto

source: TOLONG JANGAN
en: Just

source: YANG URUS, GAK?
en: handle it?

source: YAH…
en: well...

source: KUCING LIAR
en: You said we should

source: KASIAN!
en: like that!

source: YANG TERJEBAK DI
en: trapped between

source: NGESELIN BANGET
en: You have such an annoying face,

source: MUKANYA!
en: in!

source: GUA AMBIL RESIKO ITU, TETAP GAK BISA DITEBAK KAN…
en: You wouldn’t predict that I’d take that chance, right?

source: BANTU PASANG PITA, DONG!
en: help us tie the ribbon!

source: KALAU GITU
en: I guess this is where

source: KAMU SERIUS…
en: not messing around, huh?
